from btree import BTreeMap

bmap = BTreeMap()

bmap[1] = 'Один'    #добавляем значения под ключи
bmap[2] = 'Два'
bmap[3] = 'Три'

print("------------------------------------------------------")
print('Ключи:', list(bmap.keys()))
print('Значения:', list(bmap.values()))
print('Пары ключ-значение:', list(bmap.items()))

del bmap[2]   #Удаляем ключ-значение 2

print("------------------------------------------------------")
print("После удаления элемента ключа 2")
print('Ключи:', list(bmap.keys()))
print('Значения:', list(bmap.values()))
print('Пары ключ-значение:', list(bmap.items()))
print("------------------------------------------------------")

if 3 in bmap:
    bmap[3] = 'Новое значение' #замена значеиния в ключе 3
    print('Замена:', bmap[3])

if 4 not in bmap:   #добавляем значение под ключ 4
    bmap[4] = 'Четыре'
    
print("------------------------------------------------------")
print('Ключи:', list(bmap.keys()))
print('Значения:', list(bmap.values()))
print('Пары ключ-значение:', list(bmap.items()))
print("------------------------------------------------------")
print('Значение под ключем 1 -',bmap.get(1))
print("------------------------------------------------------")
print("Размер дерева до очистки", bmap.__len__())
print("------------------------------------------------------")

bmap.clear()

print("Размер дерева после очистки", bmap.__len__())
print("------------------------------------------------------")
print('Ключи:', list(bmap.keys()))
print('Значения:', list(bmap.values()))
print('Пары ключ-значение:', list(bmap.items()))